app/views/finances/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Admin"], ["LIMIT", 1]]
---
                            <h5 class="card-title fs-4 mb-2">club balance</h5>
                            <p class="text-muted mb-0"><%= User.find_by(username: 'Admin')&.balance || 0 %></p>

SELECT "users".* FROM "users"
---
                        <label for="payee_id" class="form-label">Payee (who receives the money):</label>
                        <%= form.select :payee_id,
                            [['External', 'external']] + @all_roster_players.map { |player| [player.username, player.id] },
                            { prompt: 'Select recipient:'},
                            { class: 'form-select' } %>