app/views/hub/index.html.erb

                        <label for="payee_id" class="form-label">Payee:</label>
                        <%= form.select :payee_id,
                            options_from_collection_for_select(
                                @all_roster_players.select { |player|
                                    if current_user.access_level == 'player'
                                        player.username.downcase == 'admin'
                                    else
                                        ['admin', 'external'].include?(player.username.downcase)
                                    end
                                },
                                :id, :username
                            ),
                            { prompt: 'Select recipient'},
                            { class: 'form-select' } %>
---
SELECT 1 AS one FROM "users" WHERE "users"."id" != $1 AND "users"."username" != $2 LIMIT $3  [["id", 1], ["username", "Admin"], ["LIMIT", 1]]