app/controllers/events_controller.rb

UPDATE "events" SET "event_type" = $1, "location" = $2, "notes" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["event_type", "match"], ["location", "Updated Location"], ["notes", "Updated notes"], ["updated_at", "2025-07-22 05:07:10.029901"], ["id", 15]]
---
  def update
    if @event
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 14]]
---
  def destroy
    if @event
      @event.destroy

INSERT INTO "events" ("datetime", "event_type", "location", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find_by(id: params[:id])