app/controllers/finances_controller.rb

  def index
    @all_roster_players = User.all
    @recent_transactions = Finance.order(created_at: :desc).limit(20)
    @total_balance = User.sum(:balance)
---
SELECT "users".* FROM "users"
SELECT SUM("users"."balance") FROM "users"

  def add_payment
    @payer = User.find(params[:user_id])

    if params[:payee_id] == "external"
      @payee = nil
      payee_name = "External"
    else
      @payee = User.find(params[:payee_id] || User.find_by(access_level: "admin")&.id)
      payee_name = @payee.username
    end

    amount = params[:amount].to_f
    notes = params[:notes]
    redirect_path = params[:redirect_to] || finances_path

    if @payee
      @payer.make_payment!(amount, @payee, notes)
    else
      @payer.update!(balance: @payer.balance - amount)
      Finance.create!(
        user_id: @payer.id,
        payer_id: @payer.id,
        payee_id: nil,
        amount: -amount,
        transaction_type: "external",
        notes: notes
      )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "balance" = COALESCE("balance", 0) - $1 WHERE "users"."id" = $2  [["balance", "10.5"], ["id", 6]]
INSERT INTO "finances" ("user_id", "amount", "notes", "transaction_type", "created_at", "updated_at", "payer_id", "payee_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"