app/controllers/hub_controller.rb

  def index
    @upcoming_events = Event.order(datetime: :asc).limit(5)
    @all_events = Event.order(datetime: :asc)

    @roster_players = User.where.not(id: current_user.id)
                          .where.not(username: 'Admin')
                          .order(:username)
                          .limit(5)

    @all_roster_players = User.where.not(id: current_user.id)
                              .order(:username)

    @recent_transactions = Finance.where('payer_id = ? OR payee_id = ?', current_user.id, current_user.id)
                                  .order(created_at: :desc).limit(10)
---
SELECT "events".* FROM "events" ORDER BY "events"."datetime" ASC LIMIT $1  [["LIMIT", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" != $1 AND "users"."username" != $2 ORDER BY "users"."username" ASC LIMIT $3  [["id", 1], ["username", "Admin"], ["LIMIT", 5]]
SELECT "finances".* FROM "finances" WHERE (payer_id = $1 OR payee_id = $2) ORDER BY "finances"."created_at" DESC LIMIT $3  [[nil, 1], [nil, 1], ["LIMIT", 10]]