app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if params[:user][:admin_adding_player]
      @user.access_level = "player"

      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "email", "password_digest", "access_level", "position", "chain", "car", "location", "balance") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]